MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256l.h
extern volatile __C2FLTCON2bits_t C2FLTCON2bits __asm__ ("C2FLTCON2") __attribute__((section("sfrs"), address(0xBF88C0E0)));
extern volatile uint32_t        C2FLTCON2CLR __attribute__((section("sfrs"),address(0xBF88C0E4)));
extern volatile uint32_t        C2FLTCON2SET __attribute__((section("sfrs"),address(0xBF88C0E8)));
extern volatile uint32_t        C2FLTCON2INV __attribute__((section("sfrs"),address(0xBF88C0EC)));
#define C2FLTCON3 C2FLTCON3
extern volatile uint32_t   C2FLTCON3 __attribute__((section("sfrs"), address(0xBF88C0F0)));
typedef union {
  struct {
    uint32_t FSEL12:5;
    uint32_t MSEL12:2;
    uint32_t FLTEN12:1;
    uint32_t FSEL13:5;
    uint32_t MSEL13:2;
    uint32_t FLTEN13:1;
    uint32_t FSEL14:5;
    uint32_t MSEL14:2;
    uint32_t FLTEN14:1;
    uint32_t FSEL15:5;
    uint32_t MSEL15:2;
    uint32_t FLTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON3bits_t;
extern volatile __C2FLTCON3bits_t C2FLTCON3bits __asm__ ("C2FLTCON3") __attribute__((section("sfrs"), address(0xBF88C0F0)));
extern volatile uint32_t        C2FLTCON3CLR __attribute__((section("sfrs"),address(0xBF88C0F4)));
extern volatile uint32_t        C2FLTCON3SET __attribute__((section("sfrs"),address(0xBF88C0F8)));
extern volatile uint32_t        C2FLTCON3INV __attribute__((section("sfrs"),address(0xBF88C0FC)));
#define C2FLTCON4 C2FLTCON4
extern volatile uint32_t   C2FLTCON4 __attribute__((section("sfrs"), address(0xBF88C100)));
typedef union {
  struct {
    uint32_t FSEL16:5;
    uint32_t MSEL16:2;
    uint32_t FLTEN16:1;
    uint32_t FSEL17:5;
    uint32_t MSEL17:2;
    uint32_t FLTEN17:1;
    uint32_t FSEL18:5;
    uint32_t MSEL18:2;
    uint32_t FLTEN18:1;
    uint32_t FSEL19:5;
    uint32_t MSEL19:2;
    uint32_t FLTEN19:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON4bits_t;
extern volatile __C2FLTCON4bits_t C2FLTCON4bits __asm__ ("C2FLTCON4") __attribute__((section("sfrs"), address(0xBF88C100)));
extern volatile uint32_t        C2FLTCON4CLR __attribute__((section("sfrs"),address(0xBF88C104)));
extern volatile uint32_t        C2FLTCON4SET __attribute__((section("sfrs"),address(0xBF88C108)));
extern volatile uint32_t        C2FLTCON4INV __attribute__((section("sfrs"),address(0xBF88C10C)));
#define C2FLTCON5 C2FLTCON5
extern volatile uint32_t   C2FLTCON5 __attribute__((section("sfrs"), address(0xBF88C110)));
typedef union {
  struct {
    uint32_t FSEL20:5;
    uint32_t MSEL20:2;
    uint32_t FLTEN20:1;
    uint32_t FSEL21:5;
    uint32_t MSEL21:2;
    uint32_t FLTEN21:1;
    uint32_t FSEL22:5;
    uint32_t MSEL22:2;
    uint32_t FLTEN22:1;
    uint32_t FSEL23:5;
    uint32_t MSEL23:2;
    uint32_t FLTEN23:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON5bits_t;
extern volatile __C2FLTCON5bits_t C2FLTCON5bits __asm__ ("C2FLTCON5") __attribute__((section("sfrs"), address(0xBF88C110)));
extern volatile uint32_t        C2FLTCON5CLR __attribute__((section("sfrs"),address(0xBF88C114)));
extern volatile uint32_t        C2FLTCON5SET __attribute__((section("sfrs"),address(0xBF88C118)));
extern volatile uint32_t        C2FLTCON5INV __attribute__((section("sfrs"),address(0xBF88C11C)));
#define C2FLTCON6 C2FLTCON6
extern volatile uint32_t   C2FLTCON6 __attribute__((section("sfrs"), address(0xBF88C120)));
typedef union {
  struct {
    uint32_t FSEL24:5;
    uint32_t MSEL24:2;
    uint32_t FLTEN24:1;
    uint32_t FSEL25:5;
    uint32_t MSEL25:2;
    uint32_t FLTEN25:1;
    uint32_t FSEL26:5;
    uint32_t MSEL26:2;
    uint32_t FLTEN26:1;
    uint32_t FSEL27:5;
    uint32_t MSEL27:2;
    uint32_t FLTEN27:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON6bits_t;
extern volatile __C2FLTCON6bits_t C2FLTCON6bits __asm__ ("C2FLTCON6") __attribute__((section("sfrs"), address(0xBF88C120)));
extern volatile uint32_t        C2FLTCON6CLR __attribute__((section("sfrs"),address(0xBF88C124)));
extern volatile uint32_t        C2FLTCON6SET __attribute__((section("sfrs"),address(0xBF88C128)));
extern volatile uint32_t        C2FLTCON6INV __attribute__((section("sfrs"),address(0xBF88C12C)));
#define C2FLTCON7 C2FLTCON7
extern volatile uint32_t   C2FLTCON7 __attribute__((section("sfrs"), address(0xBF88C130)));
typedef union {
  struct {
    uint32_t FSEL28:5;
    uint32_t MSEL28:2;
    uint32_t FLTEN28:1;
    uint32_t FSEL29:5;
    uint32_t MSEL29:2;
    uint32_t FLTEN29:1;
    uint32_t FSEL30:5;
    uint32_t MSEL30:2;
    uint32_t FLTEN30:1;
    uint32_t FSEL31:5;
    uint32_t MSEL31:2;
    uint32_t FLTEN31:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FLTCON7bits_t;
extern volatile __C2FLTCON7bits_t C2FLTCON7bits __asm__ ("C2FLTCON7") __attribute__((section("sfrs"), address(0xBF88C130)));
extern volatile uint32_t        C2FLTCON7CLR __attribute__((section("sfrs"),address(0xBF88C134)));
extern volatile uint32_t        C2FLTCON7SET __attribute__((section("sfrs"),address(0xBF88C138)));
extern volatile uint32_t        C2FLTCON7INV __attribute__((section("sfrs"),address(0xBF88C13C)));
#define C2RXF0 C2RXF0
extern volatile uint32_t   C2RXF0 __attribute__((section("sfrs"), address(0xBF88C140)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF0bits_t;
extern volatile __C2RXF0bits_t C2RXF0bits __asm__ ("C2RXF0") __attribute__((section("sfrs"), address(0xBF88C140)));
extern volatile uint32_t        C2RXF0CLR __attribute__((section("sfrs"),address(0xBF88C144)));
extern volatile uint32_t        C2RXF0SET __attribute__((section("sfrs"),address(0xBF88C148)));
extern volatile uint32_t        C2RXF0INV __attribute__((section("sfrs"),address(0xBF88C14C)));
#define C2RXF1 C2RXF1
extern volatile uint32_t   C2RXF1 __attribute__((section("sfrs"), address(0xBF88C150)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF1bits_t;
extern volatile __C2RXF1bits_t C2RXF1bits __asm__ ("C2RXF1") __attribute__((section("sfrs"), address(0xBF88C150)));
extern volatile uint32_t        C2RXF1CLR __attribute__((section("sfrs"),address(0xBF88C154)));
extern volatile uint32_t        C2RXF1SET __attribute__((section("sfrs"),address(0xBF88C158)));
extern volatile uint32_t        C2RXF1INV __attribute__((section("sfrs"),address(0xBF88C15C)));
#define C2RXF2 C2RXF2
extern volatile uint32_t   C2RXF2 __attribute__((section("sfrs"), address(0xBF88C160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF2bits_t;
