MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256l.h
extern volatile __C2RXF12bits_t C2RXF12bits __asm__ ("C2RXF12") __attribute__((section("sfrs"), address(0xBF88C200)));
extern volatile uint32_t        C2RXF12CLR __attribute__((section("sfrs"),address(0xBF88C204)));
extern volatile uint32_t        C2RXF12SET __attribute__((section("sfrs"),address(0xBF88C208)));
extern volatile uint32_t        C2RXF12INV __attribute__((section("sfrs"),address(0xBF88C20C)));
#define C2RXF13 C2RXF13
extern volatile uint32_t   C2RXF13 __attribute__((section("sfrs"), address(0xBF88C210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF13bits_t;
extern volatile __C2RXF13bits_t C2RXF13bits __asm__ ("C2RXF13") __attribute__((section("sfrs"), address(0xBF88C210)));
extern volatile uint32_t        C2RXF13CLR __attribute__((section("sfrs"),address(0xBF88C214)));
extern volatile uint32_t        C2RXF13SET __attribute__((section("sfrs"),address(0xBF88C218)));
extern volatile uint32_t        C2RXF13INV __attribute__((section("sfrs"),address(0xBF88C21C)));
#define C2RXF14 C2RXF14
extern volatile uint32_t   C2RXF14 __attribute__((section("sfrs"), address(0xBF88C220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF14bits_t;
extern volatile __C2RXF14bits_t C2RXF14bits __asm__ ("C2RXF14") __attribute__((section("sfrs"), address(0xBF88C220)));
extern volatile uint32_t        C2RXF14CLR __attribute__((section("sfrs"),address(0xBF88C224)));
extern volatile uint32_t        C2RXF14SET __attribute__((section("sfrs"),address(0xBF88C228)));
extern volatile uint32_t        C2RXF14INV __attribute__((section("sfrs"),address(0xBF88C22C)));
#define C2RXF15 C2RXF15
extern volatile uint32_t   C2RXF15 __attribute__((section("sfrs"), address(0xBF88C230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF15bits_t;
extern volatile __C2RXF15bits_t C2RXF15bits __asm__ ("C2RXF15") __attribute__((section("sfrs"), address(0xBF88C230)));
extern volatile uint32_t        C2RXF15CLR __attribute__((section("sfrs"),address(0xBF88C234)));
extern volatile uint32_t        C2RXF15SET __attribute__((section("sfrs"),address(0xBF88C238)));
extern volatile uint32_t        C2RXF15INV __attribute__((section("sfrs"),address(0xBF88C23C)));
#define C2RXF16 C2RXF16
extern volatile uint32_t   C2RXF16 __attribute__((section("sfrs"), address(0xBF88C240)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF16bits_t;
extern volatile __C2RXF16bits_t C2RXF16bits __asm__ ("C2RXF16") __attribute__((section("sfrs"), address(0xBF88C240)));
extern volatile uint32_t        C2RXF16CLR __attribute__((section("sfrs"),address(0xBF88C244)));
extern volatile uint32_t        C2RXF16SET __attribute__((section("sfrs"),address(0xBF88C248)));
extern volatile uint32_t        C2RXF16INV __attribute__((section("sfrs"),address(0xBF88C24C)));
#define C2RXF17 C2RXF17
extern volatile uint32_t   C2RXF17 __attribute__((section("sfrs"), address(0xBF88C250)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF17bits_t;
extern volatile __C2RXF17bits_t C2RXF17bits __asm__ ("C2RXF17") __attribute__((section("sfrs"), address(0xBF88C250)));
extern volatile uint32_t        C2RXF17CLR __attribute__((section("sfrs"),address(0xBF88C254)));
extern volatile uint32_t        C2RXF17SET __attribute__((section("sfrs"),address(0xBF88C258)));
extern volatile uint32_t        C2RXF17INV __attribute__((section("sfrs"),address(0xBF88C25C)));
#define C2RXF18 C2RXF18
extern volatile uint32_t   C2RXF18 __attribute__((section("sfrs"), address(0xBF88C260)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF18bits_t;
extern volatile __C2RXF18bits_t C2RXF18bits __asm__ ("C2RXF18") __attribute__((section("sfrs"), address(0xBF88C260)));
extern volatile uint32_t        C2RXF18CLR __attribute__((section("sfrs"),address(0xBF88C264)));
extern volatile uint32_t        C2RXF18SET __attribute__((section("sfrs"),address(0xBF88C268)));
extern volatile uint32_t        C2RXF18INV __attribute__((section("sfrs"),address(0xBF88C26C)));
#define C2RXF19 C2RXF19
extern volatile uint32_t   C2RXF19 __attribute__((section("sfrs"), address(0xBF88C270)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF19bits_t;
extern volatile __C2RXF19bits_t C2RXF19bits __asm__ ("C2RXF19") __attribute__((section("sfrs"), address(0xBF88C270)));
extern volatile uint32_t        C2RXF19CLR __attribute__((section("sfrs"),address(0xBF88C274)));
extern volatile uint32_t        C2RXF19SET __attribute__((section("sfrs"),address(0xBF88C278)));
extern volatile uint32_t        C2RXF19INV __attribute__((section("sfrs"),address(0xBF88C27C)));
#define C2RXF20 C2RXF20
extern volatile uint32_t   C2RXF20 __attribute__((section("sfrs"), address(0xBF88C280)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF20bits_t;
extern volatile __C2RXF20bits_t C2RXF20bits __asm__ ("C2RXF20") __attribute__((section("sfrs"), address(0xBF88C280)));
extern volatile uint32_t        C2RXF20CLR __attribute__((section("sfrs"),address(0xBF88C284)));
extern volatile uint32_t        C2RXF20SET __attribute__((section("sfrs"),address(0xBF88C288)));
extern volatile uint32_t        C2RXF20INV __attribute__((section("sfrs"),address(0xBF88C28C)));
#define C2RXF21 C2RXF21
extern volatile uint32_t   C2RXF21 __attribute__((section("sfrs"), address(0xBF88C290)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF21bits_t;
extern volatile __C2RXF21bits_t C2RXF21bits __asm__ ("C2RXF21") __attribute__((section("sfrs"), address(0xBF88C290)));
extern volatile uint32_t        C2RXF21CLR __attribute__((section("sfrs"),address(0xBF88C294)));
extern volatile uint32_t        C2RXF21SET __attribute__((section("sfrs"),address(0xBF88C298)));
extern volatile uint32_t        C2RXF21INV __attribute__((section("sfrs"),address(0xBF88C29C)));
#define C2RXF22 C2RXF22
extern volatile uint32_t   C2RXF22 __attribute__((section("sfrs"), address(0xBF88C2A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF22bits_t;
extern volatile __C2RXF22bits_t C2RXF22bits __asm__ ("C2RXF22") __attribute__((section("sfrs"), address(0xBF88C2A0)));
extern volatile uint32_t        C2RXF22CLR __attribute__((section("sfrs"),address(0xBF88C2A4)));
extern volatile uint32_t        C2RXF22SET __attribute__((section("sfrs"),address(0xBF88C2A8)));
extern volatile uint32_t        C2RXF22INV __attribute__((section("sfrs"),address(0xBF88C2AC)));
#define C2RXF23 C2RXF23
extern volatile uint32_t   C2RXF23 __attribute__((section("sfrs"), address(0xBF88C2B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF23bits_t;
