MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx775f256l.h
extern volatile __C2FIFOINT0bits_t C2FIFOINT0bits __asm__ ("C2FIFOINT0") __attribute__((section("sfrs"), address(0xBF88C360)));
extern volatile uint32_t        C2FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF88C364)));
extern volatile uint32_t        C2FIFOINT0SET __attribute__((section("sfrs"),address(0xBF88C368)));
extern volatile uint32_t        C2FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88C36C)));
#define C2FIFOUA0 C2FIFOUA0
extern volatile uint32_t   C2FIFOUA0 __attribute__((section("sfrs"), address(0xBF88C370)));
extern volatile uint32_t        C2FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF88C374)));
extern volatile uint32_t        C2FIFOUA0SET __attribute__((section("sfrs"),address(0xBF88C378)));
extern volatile uint32_t        C2FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88C37C)));
#define C2FIFOCI0 C2FIFOCI0
extern volatile uint32_t   C2FIFOCI0 __attribute__((section("sfrs"), address(0xBF88C380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI0bits_t;
extern volatile __C2FIFOCI0bits_t C2FIFOCI0bits __asm__ ("C2FIFOCI0") __attribute__((section("sfrs"), address(0xBF88C380)));
extern volatile uint32_t        C2FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF88C384)));
extern volatile uint32_t        C2FIFOCI0SET __attribute__((section("sfrs"),address(0xBF88C388)));
extern volatile uint32_t        C2FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88C38C)));
#define C2FIFOCON1 C2FIFOCON1
extern volatile uint32_t   C2FIFOCON1 __attribute__((section("sfrs"), address(0xBF88C390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON1bits_t;
extern volatile __C2FIFOCON1bits_t C2FIFOCON1bits __asm__ ("C2FIFOCON1") __attribute__((section("sfrs"), address(0xBF88C390)));
extern volatile uint32_t        C2FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF88C394)));
extern volatile uint32_t        C2FIFOCON1SET __attribute__((section("sfrs"),address(0xBF88C398)));
extern volatile uint32_t        C2FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88C39C)));
#define C2FIFOINT1 C2FIFOINT1
extern volatile uint32_t   C2FIFOINT1 __attribute__((section("sfrs"), address(0xBF88C3A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT1bits_t;
extern volatile __C2FIFOINT1bits_t C2FIFOINT1bits __asm__ ("C2FIFOINT1") __attribute__((section("sfrs"), address(0xBF88C3A0)));
extern volatile uint32_t        C2FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF88C3A4)));
extern volatile uint32_t        C2FIFOINT1SET __attribute__((section("sfrs"),address(0xBF88C3A8)));
extern volatile uint32_t        C2FIFOINT1INV __attribute__((section("sfrs"),address(0xBF88C3AC)));
#define C2FIFOUA1 C2FIFOUA1
extern volatile uint32_t   C2FIFOUA1 __attribute__((section("sfrs"), address(0xBF88C3B0)));
extern volatile uint32_t        C2FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF88C3B4)));
extern volatile uint32_t        C2FIFOUA1SET __attribute__((section("sfrs"),address(0xBF88C3B8)));
extern volatile uint32_t        C2FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88C3BC)));
#define C2FIFOCI1 C2FIFOCI1
extern volatile uint32_t   C2FIFOCI1 __attribute__((section("sfrs"), address(0xBF88C3C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI1bits_t;
extern volatile __C2FIFOCI1bits_t C2FIFOCI1bits __asm__ ("C2FIFOCI1") __attribute__((section("sfrs"), address(0xBF88C3C0)));
extern volatile uint32_t        C2FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF88C3C4)));
extern volatile uint32_t        C2FIFOCI1SET __attribute__((section("sfrs"),address(0xBF88C3C8)));
extern volatile uint32_t        C2FIFOCI1INV __attribute__((section("sfrs"),address(0xBF88C3CC)));
#define C2FIFOCON2 C2FIFOCON2
extern volatile uint32_t   C2FIFOCON2 __attribute__((section("sfrs"), address(0xBF88C3D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON2bits_t;
extern volatile __C2FIFOCON2bits_t C2FIFOCON2bits __asm__ ("C2FIFOCON2") __attribute__((section("sfrs"), address(0xBF88C3D0)));
extern volatile uint32_t        C2FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF88C3D4)));
extern volatile uint32_t        C2FIFOCON2SET __attribute__((section("sfrs"),address(0xBF88C3D8)));
extern volatile uint32_t        C2FIFOCON2INV __attribute__((section("sfrs"),address(0xBF88C3DC)));
#define C2FIFOINT2 C2FIFOINT2
extern volatile uint32_t   C2FIFOINT2 __attribute__((section("sfrs"), address(0xBF88C3E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT2bits_t;
extern volatile __C2FIFOINT2bits_t C2FIFOINT2bits __asm__ ("C2FIFOINT2") __attribute__((section("sfrs"), address(0xBF88C3E0)));
extern volatile uint32_t        C2FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF88C3E4)));
extern volatile uint32_t        C2FIFOINT2SET __attribute__((section("sfrs"),address(0xBF88C3E8)));
extern volatile uint32_t        C2FIFOINT2INV __attribute__((section("sfrs"),address(0xBF88C3EC)));
#define C2FIFOUA2 C2FIFOUA2
extern volatile uint32_t   C2FIFOUA2 __attribute__((section("sfrs"), address(0xBF88C3F0)));
extern volatile uint32_t        C2FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF88C3F4)));
extern volatile uint32_t        C2FIFOUA2SET __attribute__((section("sfrs"),address(0xBF88C3F8)));
extern volatile uint32_t        C2FIFOUA2INV __attribute__((section("sfrs"),address(0xBF88C3FC)));
#define C2FIFOCI2 C2FIFOCI2
extern volatile uint32_t   C2FIFOCI2 __attribute__((section("sfrs"), address(0xBF88C400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI2bits_t;
extern volatile __C2FIFOCI2bits_t C2FIFOCI2bits __asm__ ("C2FIFOCI2") __attribute__((section("sfrs"), address(0xBF88C400)));
extern volatile uint32_t        C2FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF88C404)));
extern volatile uint32_t        C2FIFOCI2SET __attribute__((section("sfrs"),address(0xBF88C408)));
extern volatile uint32_t        C2FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88C40C)));
#define C2FIFOCON3 C2FIFOCON3
extern volatile uint32_t   C2FIFOCON3 __attribute__((section("sfrs"), address(0xBF88C410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON3bits_t;
extern volatile __C2FIFOCON3bits_t C2FIFOCON3bits __asm__ ("C2FIFOCON3") __attribute__((section("sfrs"), address(0xBF88C410)));
extern volatile uint32_t        C2FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF88C414)));
extern volatile uint32_t        C2FIFOCON3SET __attribute__((section("sfrs"),address(0xBF88C418)));
extern volatile uint32_t        C2FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88C41C)));
#define C2FIFOINT3 C2FIFOINT3
extern volatile uint32_t   C2FIFOINT3 __attribute__((section("sfrs"), address(0xBF88C420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT3bits_t;
